Show / Hide Table of Contents
Class PointLoadOnLine
Load in specific point on line
Inheritance
System.Object
OpenObject
OpenElementId
PointLoadOnLine
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Loading
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Loading.PointLoadOnLine,CI.Loading", "CI.StructModel.Loading.IPointLoadOnLine,CI.BasicTypes")]
public class PointLoadOnLine : OpenElementId
Examples
This sample shows how to create a point load on the line.
//Creating the model
OpenModel openModel = new OpenModel();
//Create nodes
Point3D pointA = new Point3D();
pointA.X = 0;
pointA.Y = 0;
pointA.Z = 0;
openModel.AddObject(pointA);
Point3D pointB = new Point3D();
pointB.X = 0;
pointB.Y = 0;
pointB.Z = 1.2;
openModel.AddObject(pointB);
Point3D pointC = new Point3D();
pointC.X = 0;
pointC.Y = 0;
pointC.Z = 2.4;
openModel.AddObject(pointC);
//Line between nodes
LineSegment3D line1 = new LineSegment3D();
line1.StartPoint = new ReferenceElement(pointA);
line1.EndPoint = new ReferenceElement(pointB);
//LCS of line
line1.LocalCoordinateSystem = new CoordSystemByZup();
openModel.AddObject(line1);
//Line between nodes
LineSegment3D line2 = new LineSegment3D();
line2.StartPoint = new ReferenceElement(pointB);
line2.EndPoint = new ReferenceElement(pointC);
//LCS of line
line2.LocalCoordinateSystem = new CoordSystemByZup();
openModel.AddObject(line2);
//Load case
LoadCase loadCase = new LoadCase();
//...
openModel.AddObject(loadCase);
//Point loading impulse on the bottom of the "line1" - in the LCS of line
PointLoadOnLine pointLoadA = new PointLoadOnLine();
pointLoadA.Geometry = new ReferenceElement(line1);
pointLoadA.RelativePosition = 0.0;
pointLoadA.Fx = 10e3;
pointLoadA.Ez = 0.024;
openModel.AddObject(pointLoadA);
loadCase.PointLoadsOnLine.Add(new ReferenceElement(pointLoadA));
Constructors
Improve this Doc   View Source
PointLoadOnLine()
Constructor
Declaration
public PointLoadOnLine()
Properties
Improve this Doc   View Source
Direction
Local / global
Declaration
public LoadDirection Direction { get; set; }
Property Value
 Type |  Description
 LoadDirection
Improve this Doc   View Source
Ey
Eccentricity in Y direction
Declaration
public double Ey { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Ez
Eccentricity in Z direction
Declaration
public double Ez { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fx
Force in X direction
Declaration
public double Fx { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fy
Force in Y direction
Declaration
public double Fy { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fz
Force in Z direction
Declaration
public double Fz { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Geometry
Segment3D or PolyLine3D
Declaration
public ReferenceElement Geometry { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
Mx
Moment about the x-axis
Declaration
public double Mx { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
My
Moment about the y-axis
Declaration
public double My { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Mz
Moment about the z-axis
Declaration
public double Mz { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
RelativePosition
Relative position on geometry line
Declaration
public double RelativePosition { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source